Repository: wanggzfdm/my-clipaste
Catalog: clipaste/Localizable.xcstrings
Source language: en
Languages: de, fr, ja, ko, zh_hans, zh_hant

source: Use AI for image OCR
de: KI für Bild-OCR verwenden
fr: Utiliser l’IA pour l’OCR d’image
ja: 画像 OCR に AI を使用
ko: 이미지 OCR에 AI 사용
zh_hans: 使用 AI 进行图片 OCR
zh_hant: 使用 AI 進行圖片 OCR

source: Use Plain Text
de: Als reinen Text verwenden
fr: Utiliser le texte brut
ja: プレーンテキストを使用
ko: 일반 텍스트 사용
zh_hans: 使用纯文本
zh_hant: 使用純文字

source: Use Vertical List Layout
de: Vertikales Listenlayout verwenden
fr: Utiliser la disposition en liste verticale
ja: 縦向きリストレイアウトを使用
ko: 세로 목록 레이아웃 사용
zh_hans: 使用垂直列表布局
zh_hant: 使用縱向列表佈局

source: Useful when you repeatedly paste the same content.
de: Nützlich, wenn Sie häufig denselben Inhalt einsetzen.
fr: Utile quand vous réutilisez fréquemment le dernier contenu collé.
ja: 直前にペーストしたコンテンツを繰り返し使う場合に便利です。
ko: 방금 붙여넣은 내용을 반복적으로 사용할 때 유용합니다.
zh_hans: 适合频繁重复使用刚粘贴过的内容。
zh_hant: 適合頻繁重複使用剛貼上過的內容。

source: Vertical Compact
de: Kompakt vertikal
ja: コンパクト縦型
ko: 컴팩트 세로형
zh_hans: 紧凑垂直
zh_hant: 緊湊垂直

source: Vertical List
de: Vertikale Liste
fr: Liste verticale
ja: 縦向きリスト
ko: 세로 목록
zh_hans: 纵向列表
zh_hant: 縱向列表

source: Very Frequent (0.1s)
de: Sehr häufig (0,1 s)
fr: Très fréquent (0,1 s)
ja: 非常に頻繁 (0.1秒)
ko: 매우 자주 (0.1초)
zh_hans: 非常频繁 (0.1 秒)
zh_hant: 非常頻繁 (0.1 秒)

source: View Release Notes
de: Versionshinweise anzeigen
fr: Voir les notes de version
ja: リリースノートを表示
ko: 릴리스 노트 보기
zh_hans: 查看更新说明
zh_hant: 查看更新說明

source: Waiting for First Sync…
de: Warte auf die erste Synchronisierung…
fr: En attente de la première synchronisation…
ja: 初回同期を待機中…
ko: 첫 동기화를 기다리는 중…
zh_hans: 等待首次同步…
zh_hant: 等待首次同步…

source: Welcome to Clipaste
de: Willkommen bei Clipaste
fr: Bienvenue dans Clipaste
ja: Clipaste へようこそ
ko: Clipaste에 오신 것을 환영합니다
zh_hans: 欢迎使用 Clipaste
zh_hant: 歡迎使用 Clipaste

source: When disabled, double-clicking an item only copies it to the clipboard without sending the paste shortcut.
de: Ausgeschaltet kopiert ein Doppelklick den Inhalt nur in die Ablage, ohne den Einsetzen-Kurzbefehl zu senden.
fr: Désactivé, le double-clic copie simplement dans le presse-papiers sans envoyer le raccourci de collage.
ja: オフにすると、ダブルクリックはクリップボードへのコピーのみを行い、ペーストショートカットは送信されません。
ko: 비활성화하면 항목을 두 번 클릭해도 클립보드에 복사만 되며 붙여넣기 단축키는 전송되지 않습니다.
zh_hans: 关闭后，双击条目只会将内容复制到系统剪贴板，不会自动发送粘贴快捷键。
zh_hant: 關閉後，雙擊條目只會將內容複製到系統剪貼板，不會自動發出貼上快速鍵。

source: When enabled, items can only be deleted using Cmd+Backspace instead of just Backspace.
de: Wenn aktiviert, können Elemente nur mit Cmd+Backspace statt nur mit Backspace gelöscht werden.
fr: Lorsque cette option est activée, les éléments ne peuvent être supprimés qu’avec Cmd+Retour arrière au lieu de Retour arrière seul.
ja: 有効にすると、項目は Backspace 単体ではなく Cmd+Backspace でのみ削除できます。
ko: 활성화하면 항목은 Backspace 단독이 아니라 Cmd+Backspace 로만 삭제할 수 있습니다.
zh_hans: 开启后，项目只能使用 Cmd+Backspace 删除，而不能仅用 Backspace 删除。
zh_hant: 開啟後，項目只能使用 Cmd+Backspace 刪除，而不能僅用 Backspace 刪除。

source: Window
de: Fenster
fr: Fenêtre
ja: ウインドウ
ko: 윈도우
zh_hans: 窗口
zh_hant: 視窗

source: Yes
de: Ja
fr: Oui
ja: はい
ko: 예
zh_hans: 是
zh_hant: 是

source: You
de: Du
fr: Vous
ja: あなた
ko: 나
zh_hans: 你
zh_hant: 你

source: You can change this later in Settings.
de: Sie können dies später in den Einstellungen ändern.
fr: Vous pouvez modifier cela plus tard dans les Réglages.
ja: 後で設定から変更できます。
ko: 나중에 설정에서 변경할 수 있습니다。
zh_hans: 稍后也可以在设置中修改。
zh_hant: 稍後也可以在設定中修改。

source: You're up to date
de: Du bist auf dem neuesten Stand
fr: Vous êtes à jour
ja: 最新版です
ko: 최신 버전입니다
zh_hans: 当前已是最新版本
zh_hant: 目前已是最新版本

# 今天
source: Today
de: Heute
fr: Aujourd'hui
ja: 今日
ko: 오늘
zh_hans: 今天
zh_hant: 今天

# 从 %@ 迁移数据
source: Migrate data from %@
de: Daten von %@ migrieren
fr: Migrer les données depuis %@
ja: %@ からデータを移行
ko: %@에서 데이터 마이그레이션
zh_hans: 从 %@ 迁移数据
zh_hant: 從 %@ 遷移資料

# 原生编辑器
source: Native Editor
de: Nativer Editor
fr: Éditeur natif
ja: ネイティブエディタ
ko: 네이티브 편집기
zh_hans: 原生编辑器
zh_hant: 原生編輯器

# 导入器会读取 JSON 结构中的历史条目，并映射到 Clipaste 的 SwiftData 模型。
source: The importer reads history entries from the JSON structure and maps them to Clipaste's SwiftData model.
de: Der Importer liest Verlaufseinträge aus der JSON-Struktur und ordnet sie dem SwiftData-Modell von Clipaste zu.
fr: L'importateur lit les éléments d'historique de la structure JSON et les associe au modèle SwiftData de Clipaste.
ja: インポーターは JSON 構造内の履歴項目を読み取り、Clipaste の SwiftData モデルにマッピングします。
ko: 가져오기 도구는 JSON 구조의 기록 항목을 읽어 Clipaste의 SwiftData 모델에 매핑합니다.
zh_hans: 导入器会读取 JSON 结构中的历史条目，并映射到 Clipaste 的 SwiftData 模型。
zh_hant: 匯入器會讀取 JSON 結構中的歷史項目，並對應到 Clipaste 的 SwiftData 模型。

# 导入器将使用原生 SQLite3 读取 t_data 表的纯文本记录，不依赖任何第三方数据库库。
source: The importer uses native SQLite3 to read plain-text records from the t_data table, without relying on any third-party database libraries.
de: Der Importer verwendet natives SQLite3, um Klartextdatensätze aus der Tabelle t_data zu lesen, ohne Bibliotheken von Drittanbietern.
fr: L'importateur utilise SQLite3 natif pour lire les enregistrements en texte brut de la table t_data, sans dépendre de bibliothèques de base de données tierces.
ja: インポーターはネイティブ SQLite3 を使用して t_data テーブルのプレーンテキスト記録を読み取り、サードパーティ製データベースライブラリには依存しません。
ko: 가져오기 도구는 네이티브 SQLite3를 사용해 t_data 테이블의 일반 텍스트 레코드를 읽으며, 서드파티 데이터베이스 라이브러리에 의존하지 않습니다.
zh_hans: 导入器将使用原生 SQLite3 读取 t_data 表的纯文本记录，不依赖任何第三方数据库库。
zh_hant: 匯入器將使用原生 SQLite3 讀取 t_data 資料表的純文字記錄，不依賴任何第三方資料庫函式庫。

# 导入器将使用原生 SQLite3 读取 ZHISTORYITEM 表的文本记录，不依赖任何第三方数据库库。
source: The importer uses native SQLite3 to read text records from the ZHISTORYITEM table, without relying on any third-party database libraries.
de: Der Importer verwendet natives SQLite3, um Textdatensätze aus der Tabelle ZHISTORYITEM zu lesen, ohne Bibliotheken von Drittanbietern.
fr: L'importateur utilise SQLite3 natif pour lire les enregistrements texte de la table ZHISTORYITEM, sans dépendre de bibliothèques de base de données tierces.
ja: インポーターはネイティブ SQLite3 を使用して ZHISTORYITEM テーブルのテキスト記録を読み取り、サードパーティ製データベースライブラリには依存しません。
ko: 가져오기 도구는 네이티브 SQLite3를 사용해 ZHISTORYITEM 테이블의 텍스트 레코드를 읽으며, 서드파티 데이터베이스 라이브러리에 의존하지 않습니다.
zh_hans: 导入器将使用原生 SQLite3 读取 ZHISTORYITEM 表的文本记录，不依赖任何第三方数据库库。
zh_hant: 匯入器將使用原生 SQLite3 讀取 ZHISTORYITEM 資料表的文字記錄，不依賴任何第三方資料庫函式庫。

# 导入器将使用原生 SQLite3 读取 ZRAWPREVIEW 二进制 JSON，不依赖任何第三方数据库库。
source: The importer uses native SQLite3 to read binary JSON from ZRAWPREVIEW, without relying on any third-party database libraries.
de: Der Importer verwendet natives SQLite3, um binäres JSON aus ZRAWPREVIEW zu lesen, ohne Bibliotheken von Drittanbietern.
fr: L'importateur utilise SQLite3 natif pour lire le JSON binaire depuis ZRAWPREVIEW, sans dépendre de bibliothèques de base de données tierces.
ja: インポーターはネイティブ SQLite3 を使用して ZRAWPREVIEW のバイナリ JSON を読み取り、サードパーティ製データベースライブラリには依存しません。
ko: 가져오기 도구는 네이티브 SQLite3를 사용해 ZRAWPREVIEW의 바이너리 JSON을 읽으며, 서드파티 데이터베이스 라이브러리에 의존하지 않습니다.
zh_hans: 导入器将使用原生 SQLite3 读取 ZRAWPREVIEW 二进制 JSON，不依赖任何第三方数据库库。
zh_hant: 匯入器將使用原生 SQLite3 讀取 ZRAWPREVIEW 二進位 JSON，不依賴任何第三方資料庫函式庫。

# 昨天
source: Yesterday
de: Gestern
fr: Hier
ja: 昨日
ko: 어제
zh_hans: 昨天
zh_hant: 昨天

# 编辑器类型
source: Editor Type
de: Editor-Typ
fr: Type d'éditeur
ja: エディタタイプ
ko: 편집기 유형
zh_hans: 编辑器类型
zh_hant: 編輯器類型

# 请选择 %@ 导出的 JSON 文件。Clipaste 会按 PasteNow 专用 JSON 路由解析。
source: Select the JSON file exported by %@. Clipaste will parse it using the dedicated PasteNow JSON route.
de: Wähle die von %@ exportierte JSON-Datei aus. Clipaste analysiert sie über den speziellen PasteNow-JSON-Pfad.
fr: Sélectionnez le fichier JSON exporté par %@. Clipaste l'analysera via la route JSON dédiée à PasteNow.
ja: %@ が書き出した JSON ファイルを選択してください。Clipaste は PasteNow 専用の JSON ルートで解析します。
ko: %@에서 내보낸 JSON 파일을 선택하세요. Clipaste가 PasteNow 전용 JSON 경로로 파싱합니다.
zh_hans: 请选择 %@ 导出的 JSON 文件。Clipaste 会按 PasteNow 专用 JSON 路由解析。
zh_hant: 請選擇 %@ 匯出的 JSON 檔案。Clipaste 會以 PasteNow 專用 JSON 路由解析。

# 请选择 %@ 的 SQLite 数据库。
source: Select the SQLite database of %@.
de: Wähle die SQLite-Datenbank von %@ aus.
fr: Sélectionnez la base de données SQLite de %@.
ja: %@ の SQLite データベースを選択してください。
ko: %@의 SQLite 데이터베이스를 선택하세요.
zh_hans: 请选择 %@ 的 SQLite 数据库。
zh_hant: 請選擇 %@ 的 SQLite 資料庫。

# 请选择 Maccy 的 SQLite 数据库文件。
source: Select the Maccy SQLite database file.
de: Wähle die SQLite-Datenbankdatei von Maccy aus.
fr: Sélectionnez le fichier de base de données SQLite de Maccy.
ja: Maccy の SQLite データベースファイルを選択してください。
ko: Maccy SQLite 데이터베이스 파일을 선택하세요.
zh_hans: 请选择 Maccy 的 SQLite 数据库文件。
zh_hant: 請選擇 Maccy 的 SQLite 資料庫檔案。

# 轻量级编辑器
source: Lightweight Editor
de: Leichter Editor
fr: Éditeur léger
ja: 軽量エディタ
ko: 가벼운 편집기
zh_hans: 轻量级编辑器
zh_hant: 輕量級編輯器

source: App Name
fr: Nom de l'app
ja: アプリ名
ko: 앱 이름
zh_hans: 应用名称
zh_hant: 應用程式名稱

source: Browser
fr: navigateur
ja: ブラウザ
ko: 브라우저
zh_hans: 浏览器
zh_hant: 瀏覽器

# Link Content
source: Link
fr: Lien
ja: リンク
ko: 링크
zh_hans: 链接
zh_hant: 連結

source: Name
fr: Nom
ja: 名前
ko: 이름
zh_hans: 名称
zh_hant: 名稱

source: Pink
fr: Rose
ja: ピンク
ko: 분홍색
zh_hans: 粉色
zh_hant: 粉色

source: Software Update
fr: Mise à jour logicielle
ja: ソフトウェアアップデート
ko: 소프트웨어 업데이트
zh_hans: 版本更新
zh_hant: 版本更新

source: Teal
fr: Sarcelle
ja: ティール
ko: 틸
zh_hans: 蓝绿色
zh_hant: 藍綠色

# Text Content
source: Text
fr: Texte
ja: テキスト
ko: 텍스트
zh_hans: 文本
zh_hant: 文字

source: Text Format
fr: Format du texte
ja: テキストフォーマット
ko: 텍스트 형식
zh_hans: 文字格式
zh_hant: 文字格式

source: Build
ja: ビルド
ko: 빌드
zh_hans: 构建号
zh_hant: 建置號碼

# Code Content
source: Code
ja: コード
ko: 코드
zh_hans: 代码
zh_hant: 程式碼

source: Cyan
ja: シアン
ko: 시안
zh_hans: 青色
zh_hant: 青色

source: Indigo
ja: インディゴ
ko: 남색
zh_hans: 靛蓝
zh_hant: 靛藍

source: Normal (1s)
ja: 普通 (1秒)
ko: 보통 (1초)
zh_hans: 正常 (1 秒)
zh_hant: 正常 (1 秒)

source: Orange
ja: オレンジ
ko: 주황색
zh_hans: 橙色
zh_hant: 橙色

source: Version
ja: バージョン
ko: 버전
zh_hans: 版本
zh_hant: 版本

source: Version %@ (%@)
ja: バージョン %@（%@）
ko: 버전 %@（%@）
zh_hans: 版本 %@（%@）
zh_hant: 版本 %@（%@）

source: Authorization Required — Enable in System Settings
zh_hans: 需要授权 — 去系统设置中开启
zh_hant: 需要授權 — 前往系統設定開啟

source: Authorized — Continue
zh_hans: 已授权 — 继续
zh_hant: 已授權 — 繼續

source: Browse your complete clipboard history, not just the latest 10.
zh_hans: 浏览完整的剪贴板历史，而非仅最近 10 条。
zh_hant: 瀏覽完整的剪貼簿歷史，不僅限最近 10 筆。

source: Delete Selected History?
zh_hans: 确认删除选中的历史吗？
zh_hant: 確認刪除選取的歷史嗎？

source: Edit Group
zh_hans: 编辑分组
zh_hant: 編輯群組

source: Failed
zh_hans: 失败
zh_hant: 失敗

source: Free plan shows latest 10 records only
zh_hans: 免费版当前仅显示最近 10 条记录
zh_hant: 免費版目前僅顯示最近 10 筆紀錄

source: Instantly search text, links, and code snippets — find anything faster.
zh_hans: 即时搜索文本、链接和代码片段——更快找到所需内容。
zh_hant: 即時搜尋文字、連結和程式碼片段——更快找到所需內容。

source: Next
zh_hans: 下一步
zh_hant: 下一步

source: No icons found
zh_hans: 未找到图标
zh_hant: 找不到圖示

source: One-click format stripping for clean output.
zh_hans: 一键剥离格式，输出纯净文本。
zh_hant: 一鍵剝離格式，輸出乾淨文字。

source: Only the wake shortcut is registered globally. Other actions work only while the Clipaste panel is focused.
zh_hans: 只有呼出快捷键会全局注册。其他操作仅在 Clipaste 面板获得焦点时生效。
zh_hant: 只有喚出快捷鍵會全域註冊。其他操作僅在 Clipaste 面板取得焦點時生效。

source: Open Clipboard History
zh_hans: 打开剪贴板历史
zh_hant: 打開剪貼簿歷史

source: Remove from Group
zh_hans: 从分组移除
zh_hant: 從群組移除

source: Return to Clipaste after authorizing; status refreshes automatically.
zh_hans: 授权后返回 Clipaste，状态会自动刷新。
zh_hant: 授權後返回 Clipaste，狀態會自動重新整理。

source: Search icons…
zh_hans: 搜索图标…
zh_hant: 搜尋圖示…

source: Sync history across all Macs signed in with the same Apple ID.
zh_hans: 在使用同一 Apple ID 登录的所有 Mac 间同步历史。
zh_hant: 在使用同一 Apple ID 登入的所有 Mac 間同步歷史。

source: The View layer handles source selection, file picking, and status display; all parsing and routing is managed by MigrationManager.
zh_hans: 视图层负责来源选择、文件拾取和状态展示；所有解析和路由由 MigrationManager 管理。
zh_hant: 視圖層負責來源選擇、檔案擷取和狀態展示；所有解析和路由由 MigrationManager 管理。
